#pragma once
#include"Flower.h"






class FlowerShopMenu : public FlowerShop   {
public:
	  FlowerShopMenu() {
	   cout << "#######################################" << endl
			<< " Добро пожаловать в Цветочный магазин  " << endl
			<< "########################################" << endl
		    << " Выберите вариант цветов:              " << endl
			<< " 1.2 Вид шиповников                " << endl
			<< " 1.3 Вид тюльпанов                 " << endl
			<< " 1.4 Вид Анемон                    " << endl
			<< " 1.5 Вид Бегониев                  " << endl
			<< " 2. Заказ по телефону              " << endl
			<< " 3. Выход                          " << endl
			<< "########################################" << endl;

		

	}